app/Controllers/Categorias.php

SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $categorias = $this->categorias->where('activo', $activo)->findAll();

SELECT *
FROM `categorias`
WHERE `activo` = 0
---
    public function eliminados($activo = 0)
    {
        $categorias = $this->categorias->where('activo', $activo)->findAll();

UPDATE `categorias` SET `activo` = 0, `fecha_edit` = '2024-09-07 23:05:48'
WHERE `categorias`.`id` IN ('7')
---
    public function reingresar($id)
    {
        $this->categorias->update($id, ['activo' => 1]);