app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $productos = $this->productos->where('activo', $activo)->findAll();

SELECT *
FROM `productos`
WHERE `activo` = 0
---
    public function eliminados($activo = 0)
    {
        $productos = $this->productos->where('activo', $activo)->findAll();

SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function nuevo()
    {
        $unidades = $this->unidades->where('activo', 1)->findAll();
        $categorias = $this->categorias->where('activo', 1)->findAll();

SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `productos`
WHERE `id` = '2'
 LIMIT 1
---
    public function editar($id)
    {
        $unidades = $this->unidades->where('activo', 1)->findAll();
        $categorias = $this->categorias->where('activo', 1)->findAll();
        $producto =$this->productos->where('id', $id)->first();

UPDATE `productos` SET `nombre` = 'Refresco0', `fecha_edit` = '2024-09-08 00:32:11'
WHERE `productos`.`id` IN ('2')
---
    public function actualizar()
    {
        $this->productos->update($this->request->getpost('id'), [
            'nombre' =>
                $this->request->getPost('nombre')
        ]);